<a href="https://colab.research.google.com/github/cherrrity/SOLUX_summer_data/blob/master/pandas_07~14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
# 8강 Group by 

# data

import pandas as pd

student_list = [
                {'name':'John', 'major':'computer science',  'sex':'male'},
                {'name':'anna', 'major':'physics',  'sex':'male'},
                {'name':'amy', 'major':'economics',  'sex':'male'},
                {'name':'micle', 'major':'computer science',  'sex':'male'},
                {'name':'jax', 'major':'psychology',  'sex':'male'},
                {'name':'minhyong', 'major':'mathematics',  'sex':'male'},
                {'name':'minhyong', 'major':'mathematics',  'sex':'male'},
              ]


df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])

In [3]:
df

       name             major   sex
0      John  computer science  male
1      anna           physics  male
2       amy         economics  male
3     micle  computer science  male
4       jax        psychology  male
5  minhyong       mathematics  male

In [5]:
groupby_major = df.groupby('major');
groupby_major

In [6]:
for name, group in groupby_major:
  print(name+ " : "+ str(len(group)))
  print(group)
  print()

computer science : 2
    name             major   sex
0   John  computer science  male
3  micle  computer science  male

economics : 1
  name      major   sex
2  amy  economics  male

mathematics : 1
       name        major   sex
5  minhyong  mathematics  male

physics : 1
   name    major   sex
1  anna  physics  male

psychology : 1
  name       major   sex
4  jax  psychology  male

In [7]:
df_major_cnt = pd.DataFrame({'count': groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  computer science      2
1         economics      1
2       mathematics      1
3           physics      1
4        psychology      1

In [10]:
#9 중복 제거

df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [11]:
df.duplicated(['name']) # 이름이 같은 경우

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [13]:
df.duplicated(['name'], keep = 'last') # 이름이 같은 경우 keep first, last

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [37]:
# 10강 nan 값 변경

student_list = [
                {'name':'John', 'major':'computer science',  'sex':'male', 'age': 20},
                {'name':'anna', 'major':'physics',  'sex':'male', 'age': 30},
                {'name':'amy', 'major':'economics',  'sex':'male', 'age': 40},
                {'name':'micle', 'major':'computer science',  'sex':'male', 'age': 23},
                {'name':'jax', 'major':'psychology',  'sex':'male', 'age': 25},
                {'name':'minhyong', 'major':'mathematics',  'sex':'male', },
                {'name':'minhyong', 'major':'mathematics',  'sex':'male', },
              ]


df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex','age'])

In [21]:
df.shape

(7, 4)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   major   7 non-null      object
 2   sex     7 non-null      object
 3   age     5 non-null      float64
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [23]:
df.isna()

    name  major    sex    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False   True
6  False  False  False   True

In [24]:
#0으로 변경

df.age = df.age.fillna(0) #df 의 age 컬럼의 null값을 0 으로 변경

In [25]:
df

       name             major   sex   age
0      John  computer science  male  20.0
1      anna           physics  male  30.0
2       amy         economics  male  40.0
3     micle  computer science  male  23.0
4       jax        psychology  male  25.0
5  minhyong       mathematics  male   0.0
6  minhyong       mathematics  male   0.0

In [40]:
# 중간값으로 변경

df['age'].fillna(df.groupby('sex')['age'].transform('median'), inplace = True)

In [41]:
df

       name             major   sex   age
0      John  computer science  male  20.0
1      anna           physics  male  30.0
2       amy         economics  male  40.0
3     micle  computer science  male  23.0
4       jax        psychology  male  25.0
5  minhyong       mathematics  male  25.0
6  minhyong       mathematics  male  25.0

In [42]:
# 11강 apply

def extract_major(col):
  return col.split(" ")[0]

In [43]:
df['major'] = df['major'].apply(extract_major)

In [44]:
df

       name        major   sex   age
0      John     computer  male  20.0
1      anna      physics  male  30.0
2       amy    economics  male  40.0
3     micle     computer  male  23.0
4       jax   psychology  male  25.0
5  minhyong  mathematics  male  25.0
6  minhyong  mathematics  male  25.0

In [46]:
def get_intro(age, prefix, suffix):
  return prefix + str(age) + suffix

df['intro'] = df['age'].apply(get_intro, prefix="I am " , suffix=" years old")

In [47]:
df

       name        major   sex   age               intro
0      John     computer  male  20.0  I am20.0 years old
1      anna      physics  male  30.0  I am30.0 years old
2       amy    economics  male  40.0  I am40.0 years old
3     micle     computer  male  23.0  I am23.0 years old
4       jax   psychology  male  25.0  I am25.0 years old
5  minhyong  mathematics  male  25.0  I am25.0 years old
6  minhyong  mathematics  male  25.0  I am25.0 years old

In [48]:
def get_intro2(row):
  return "My major is "+ str(row.major) + " my age is "+str(row.age)

df.intro = df.apply(get_intro2, axis=1)

In [49]:
df

       name        major   sex   age                                   intro
0      John     computer  male  20.0     My major is computer my age is 20.0
1      anna      physics  male  30.0      My major is physics my age is 30.0
2       amy    economics  male  40.0    My major is economics my age is 40.0
3     micle     computer  male  23.0     My major is computer my age is 23.0
4       jax   psychology  male  25.0   My major is psychology my age is 25.0
5  minhyong  mathematics  male  25.0  My major is mathematics my age is 25.0
6  minhyong  mathematics  male  25.0  My major is mathematics my age is 25.0

In [50]:
# 12강 map, applymap 

student_list = [
                {'name':'John', 'major':'computer science',  'sex':'male', 'age': 20},
                {'name':'anna', 'major':'physics',  'sex':'male', 'age': 30},
                {'name':'amy', 'major':'economics',  'sex':'male', 'age': 40},
                {'name':'micle', 'major':'computer science',  'sex':'male', 'age': 23},
                {'name':'jax', 'major':'psychology',  'sex':'male', 'age': 25},
                {'name':'minhyong', 'major':'mathematics',  'sex':'male', },
                {'name':'minhyong', 'major':'mathematics',  'sex':'male', },
              ]


df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex','age'])

In [51]:
df

       name             major   sex   age
0      John  computer science  male  20.0
1      anna           physics  male  30.0
2       amy         economics  male  40.0
3     micle  computer science  male  23.0
4       jax        psychology  male  25.0
5  minhyong       mathematics  male   NaN
6  minhyong       mathematics  male   NaN

In [52]:
df.sex = df.sex.map({'male': 1, 'female': 2})

In [55]:
df

       name             major  sex   age
0      John  computer science    1  20.0
1      anna           physics    1  30.0
2       amy         economics    1  40.0
3     micle  computer science    1  23.0
4       jax        psychology    1  25.0
5  minhyong       mathematics    1   NaN
6  minhyong       mathematics    1   NaN

In [54]:
import numpy as np

In [57]:
# applymap -> 데이터를 한번에 적용 ex np.arroud

In [58]:
# 13강 유니크 값

df

       name             major  sex   age
0      John  computer science    1  20.0
1      anna           physics    1  30.0
2       amy         economics    1  40.0
3     micle  computer science    1  23.0
4       jax        psychology    1  25.0
5  minhyong       mathematics    1   NaN
6  minhyong       mathematics    1   NaN

In [60]:
df.major.unique()

array(['computer science', 'physics', 'economics', 'psychology',
       'mathematics'], dtype=object)

In [61]:
df.major.value_counts()

mathematics         2
computer science    2
economics           1
physics             1
psychology          1
Name: major, dtype: int64

In [63]:
#14 강 두개의 프레임 합치기

l1 = [
      {'name':'John', 'job':'teacher'},
      {'name':'Nate', 'job':'student'},
      {'name':'Fred', 'job':'developer'},
]


l2 = [
      {'name':'Jack', 'job':'dentist'},
      {'name':'Ted', 'job':'idol'},
      {'name':'Juni', 'job':'singer'},
]


l3 = [
      {'name':'somi', 'job':'dancer'},
      {'name':'shone', 'job':'student'},
      {'name':'Gave', 'job':'developer'},
]

l4 = [
      {'age': 25, 'country': 'U.K'},
      {'age': 30, 'country':':LA'},
      {'age': 45, 'country':'korea'},
]

df1 = pd.DataFrame(l1, columns=['name', 'job'])
df2 = pd.DataFrame(l2, columns=['name', 'job'])

In [64]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [65]:
df2

   name      job
0  Jack  dentist
1   Ted     idol
2  Juni   singer

In [67]:
# df1df2 합치기

result = pd.concat([df1, df2], ignore_index= True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3  Jack    dentist
4   Ted       idol
5  Juni     singer

In [70]:
result = df1.append(df2, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3  Jack    dentist
4   Ted       idol
5  Juni     singer

In [71]:

# 열 합치기

df1 = pd.DataFrame(l3, columns=['name', 'job'])
df2 = pd.DataFrame(l4, columns=['age', 'country'])

In [72]:
df1

    name        job
0   somi     dancer
1  shone    student
2   Gave  developer

In [74]:
df2

   age country
0   25     U.K
1   30     :LA
2   45   korea

In [76]:
result = pd.concat([df1, df2], axis =1, ignore_index = True)
result

       0          1   2      3
0   somi     dancer  25    U.K
1  shone    student  30    :LA
2   Gave  developer  45  korea

In [77]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

comparison = pd.DataFrame({'label': label, 'prediction': prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4